Revit 2027 API
ParameterTypeId.StairsLandingtypeStructure Property
 "Structure": Structure
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsLandingtypeStructure { get; }
Public Shared ReadOnly Property StairsLandingtypeStructure As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsLandingtypeStructure {
	ForgeTypeId^ get ();
}
static member StairsLandingtypeStructure : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace